<template>
  <p class="description">
 منصة حديثة لتصميم وتوثيق البنية المعمارية للأنظمة الرقمية، تساعدك على بناء مخططات دقيقة لتطبيقات الويب والخدمات الخلفية والبنى السحابية وقواعد البيانات، مع تمثيل العلاقات بين المكونات وفق مبادئ معمارية مستوحاة من نموذج C4 وأساليب التصميم الحديثة.
تم تصميم الأداة لتكون خفيفة وسريعة وتعمل محليًا بالكامل، مع قابلية التوسع وربطها ببيئات التطوير وأنظمة الأعمال مستقبلًا.
  </p>
</template>

<style scoped>
.description {
  font-size: 18px;
  max-width: 480px;
  line-height: 1.7;
  margin: 20px auto;
  color: #555;

  /* أهم شيء */
  direction: rtl;
  text-align: right;

  /* يجعل الإنجليزي يظهر بشكل صحيح داخل النص العربي */
  unicode-bidi: plaintext;
}
</style>
